app/controllers/pizzas_controller.rb

SELECT "pizzas".* FROM "pizzas"
---
    def index
        pizza = Pizza.all