app/controllers/restaurant_pizzas_controller.rb

    def create
        new_restaurant = RestaurantPizza.create(restaurant_pizza_params)
        pizza = Pizza.find_by(id: new_restaurant.pizza_id)
---
INSERT INTO "restaurant_pizzas" ("price", "pizza_id", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 20], ["pizza_id", 9], ["restaurant_id", 3], ["created_at", "2023-03-20 08:10:19.307733"], ["updated_at", "2023-03-20 08:10:19.307733"]]
SELECT "pizzas".* FROM "pizzas" WHERE "pizzas"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]