app/controllers/restaurants_controller.rb

    def index
        restaurant = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

    def show
        begin
        id = params[:id]
        restaurant = Restaurant.find(id)
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

    def destroy
        begin
          restaurant = Restaurant.find(params[:id])
          restaurant.destroy
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 8]]